# Taps
tap "dimentium/autoraise"
tap "oven-sh/bun"

# CLI tools
brew "bat"
brew "coreutils"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "jq"
brew "make"
brew "oven-sh/bun/bun"
brew "ripgrep"
brew "syncthing"
brew "tailscale"
brew "zoxide"
brew "zsh"

# GUI apps
cask "anydesk"
cask "applite"
cask "autoraiseapp"
cask "claude-code"
cask "discord"
cask "ghostty"
cask "keyclu"
cask "obsidian"
cask "opencode-desktop"
cask "orbstack"
cask "rectangle"
cask "visual-studio-code"
cask "wispr-flow"
